БПКР/src/Documents/ОтчетыПоСоциальномуФонду/ОтчетыПоСоциальномуФонду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетыПоСоциальномуФонду</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСдачиОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательстваПоСтраховымВзносам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательстваПоПенсионномуФонду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереплатаПоСтраховымВзносам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереплатаПоПенсионномуФонду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Округление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>EnumRef.Тарифы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОЗанятостиИЗаработнойПлате</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФондОплатыТруда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйФондОплатыТруда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленныеСтраховыеВзносы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачсиленыеВзносыПоНПФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФондОплатыТрудаПоКатегориям</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Численность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТБолее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФОТМенее</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопФОТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/InformationRegisters/ПределыПоПодразделениям/ПределыПоПодразделениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПределыПоПодразделениям</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>МинимальныйРасчетныйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднемесячнаяЗПСФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтделениеСФ</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>УГНС</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/AccumulationRegisters/ДанныеДляОтчетаПоСФЕжемесячному/ДанныеДляОтчетаПоСФЕжемесячному.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДанныеДляОтчетаПоСФЕжемесячному</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПриведеннаяСЗП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФОТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопФОТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачисленныеВзносы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГНПФР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииСотрудников</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БПКР/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяТрудовогоКодекса</name>
    <type>
      <types>CatalogRef.СтатьиТрудовогоКодекса</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/Enums/ВидыКадровыхСобытий/ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>НачальныеДанные</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Documents/ОтчетыПоСоциальномуФонду/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСоцфонд(ДанныеУчетнойПолитики) Экспорт
	
	Период = ?(ЗначениеЗаполнено(ДатаСдачиОтчета), КонецДня(ДатаСдачиОтчета)+1, КонецМесяца(Дата) + 1);
	
	// Определение отбора по подразделениям.
	МассивПодразделений = Новый Массив;
	Если ДанныеУчетнойПолитики.ПределыПоПодразделениям Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПределыПоПодразделениямСрезПоследних.Подразделение КАК Подразделение
			|ИЗ
			|	РегистрСведений.ПределыПоПодразделениям.СрезПоследних(&Период, Организация = &Организация) КАК ПределыПоПодразделениямСрезПоследних
			|ГДЕ
			|	ПределыПоПодразделениямСрезПоследних.ОтделениеСФ = &ОтделениеСФ";
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ОтделениеСФ", Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивПодразделений.Добавить(ВыборкаДетальныеЗаписи.Подразделение);		
		КонецЦикла;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.Физлицо КАК ФизЛицо,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.Физлицо.Наименование КАК ФизЛицоНаименование,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.Категория КАК Категория,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.ФОТОборот КАК ФондОплатыТруда,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.ДопФОТОборот КАК ДополнительныйФондОплатыТруда,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.НачисленныеВзносыОборот КАК НачисленныеСтраховыеВзносы,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.ГНПФРОборот КАК НачсиленыеВзносыПоНПФ,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.НормаДнейОборот КАК Дней,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.ФактДнейОборот КАК ФактическиДней,
		|	ДанныеДляОтчетаПоСФЕжемесячномуОбороты.ПриведеннаяСЗПОборот КАК ПриведеннаяСЗПОборот
		|ПОМЕСТИТЬ ВременнаяТаблицаДанные
		|ИЗ
		|	РегистрНакопления.ДанныеДляОтчетаПоСФЕжемесячному.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И Подразделение В (&МассивПодразделений)) КАК ДанныеДляОтчетаПоСФЕжемесячномуОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанные.ФизЛицо КАК ФизЛицо,
		|	ВременнаяТаблицаДанные.ФизЛицоНаименование КАК ФизЛицоНаименование,
		|	ВременнаяТаблицаДанные.Категория КАК Категория,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаДанные.ФондОплатыТруда КАК ЧИСЛО(15, 2)) КАК ФондОплатыТруда,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаДанные.ДополнительныйФондОплатыТруда КАК ЧИСЛО(15, 2)) КАК ДополнительныйФондОплатыТруда,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаДанные.НачисленныеСтраховыеВзносы КАК ЧИСЛО(15, 2)) КАК НачисленныеСтраховыеВзносы,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаДанные.НачсиленыеВзносыПоНПФ КАК ЧИСЛО(15, 2)) КАК НачсиленыеВзносыПоНПФ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СотрудникиПрием.Период, &НачалоПериода) < &НачалоПериода
		|			ТОГДА &НачалоПериода
		|		ИНАЧЕ ЕСТЬNULL(СотрудникиПрием.Период, &НачалоПериода)
		|	КОНЕЦ КАК ДатаНачалаРаботы,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СотрудникиУвольнение.Период, &КонецПериода) > &НачалоПериода
		|			ТОГДА ЕСТЬNULL(СотрудникиУвольнение.Период, &КонецПериода)
		|		ИНАЧЕ &КонецПериода
		|	КОНЕЦ КАК ДатаОкончанияРаботы,
		|	ВременнаяТаблицаДанные.Дней КАК Дней,
		|	ВременнаяТаблицаДанные.ФактическиДней КАК ФактическиДней
		|ИЗ
		|	ВременнаяТаблицаДанные КАК ВременнаяТаблицаДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
		|				&КонецПериода,
		|				ФизЛицо В
		|						(ВЫБРАТЬ
		|							ВременнаяТаблицаДанные.ФизЛицо КАК ФизЛицо
		|						ИЗ
		|							ВременнаяТаблицаДанные КАК ВременнаяТаблицаДанные)
		|					И Организация = &Организация
		|					И ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Прием)) КАК СотрудникиПрием
		|		ПО ВременнаяТаблицаДанные.ФизЛицо = СотрудникиПрием.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
		|				&КонецПериода,
		|				ФизЛицо В
		|						(ВЫБРАТЬ
		|							ВременнаяТаблицаДанные.ФизЛицо КАК ФизЛицо
		|						ИЗ
		|							ВременнаяТаблицаДанные КАК ВременнаяТаблицаДанные)
		|					И Организация = &Организация
		|					И ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) КАК СотрудникиУвольнение
		|		ПО ВременнаяТаблицаДанные.ФизЛицо = СотрудникиУвольнение.ФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВременнаяТаблицаДанные.ФизЛицоНаименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		
		|ВЫБРАТЬ
		|	ВременнаяТаблицаДанные.Категория КАК Категория,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДанные.ПриведеннаяСЗПОборот > ВременнаяТаблицаДанные.ФондОплатыТруда
		|				ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаДанные.ФондОплатыТруда КАК ЧИСЛО(15, 2))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ФОТМенее,
		|	СУММА(ВременнаяТаблицаДанные.ДополнительныйФондОплатыТруда) КАК ДопФОТ,
		|	СУММА(ВЫБОР
		|			КОГДА ВременнаяТаблицаДанные.ПриведеннаяСЗПОборот <= ВременнаяТаблицаДанные.ФондОплатыТруда
		|				ТОГДА ВЫРАЗИТЬ(ВременнаяТаблицаДанные.ФондОплатыТруда КАК ЧИСЛО(15, 2))
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ФОТБолее,
		|	СУММА(ВЫРАЗИТЬ(ВременнаяТаблицаДанные.ФондОплатыТруда + ВременнаяТаблицаДанные.ДополнительныйФондОплатыТруда КАК ЧИСЛО(15, 2))) КАК Итого,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВременнаяТаблицаДанные.ФизЛицо) КАК Численность
		|ИЗ
		|	ВременнаяТаблицаДанные КАК ВременнаяТаблицаДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблицаДанные.Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК ЧИСЛО(15, 2)) КАК ОстатокСтраховыхВзносов
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет В (&СписокСчетов), , Организация = &Организация) КАК ХозрасчетныйОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстаток, 0) КАК ЧИСЛО(15, 2)) КАК ОстатокПенсионногоФонда
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&Дата, Счет = &Счет, , Организация = &Организация) КАК ХозрасчетныйОстатки";
	Если Округление Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧИСЛО(15, 2)", "ЧИСЛО(15, 0)");
	КонецЕсли;
	
	Если ДанныеУчетнойПолитики.ПределыПоПодразделениям Тогда
		Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подразделение В (&МассивПодразделений)", "ИСТИНА");
	КонецЕсли;	
	
	ДанныеУчетнойПолитики = БухгалтерскийУчетСервер.ПолучитьДанныеУчетнойПолитикиПоПерсоналу(Дата, Организация);
	МассивСчетов = Новый Массив();
	МассивСчетов.Добавить(ДанныеУчетнойПолитики.СчетУчетаРасчетовПФФ);
	МассивСчетов.Добавить(ДанныеУчетнойПолитики.СчетУчетаРасчетовМСФ);
	МассивСчетов.Добавить(ДанныеУчетнойПолитики.СчетУчетаРасчетовФОТФ);
	СчетГНПФР = ДанныеУчетнойПолитики.СчетУчетаРасчетовГНПФР;
	
	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.УстановитьПараметр("СписокСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("Счет", СчетГНПФР);
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));            
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СведенияОЗанятостиИЗаработнойПлате.Загрузить(РезультатЗапроса[1].Выгрузить());
	ФондОплатыТрудаПоКатегориям.Загрузить(РезультатЗапроса[2].Выгрузить());
	
	ОбязательстваПоСтраховымВзносам = 0;
	ОбязательстваПоПенсионномуФонду = 0;
	ПереплатаПоСтраховымВзносам 	= 0;
	ПереплатаПоПенсионномуФонду	 	= 0;
	
	СтраховыеВзносы = РезультатЗапроса[3].Выгрузить()[0].ОстатокСтраховыхВзносов;
	Если СтраховыеВзносы > 0 Тогда
		ПереплатаПоСтраховымВзносам = СтраховыеВзносы;
	ИначеЕсли СтраховыеВзносы < 0 Тогда
		ОбязательстваПоСтраховымВзносам = - СтраховыеВзносы;
	КонецЕсли;
	
	ПенсионныйФонд = РезультатЗапроса[4].Выгрузить()[0].ОстатокПенсионногоФонда;
	Если ПенсионныйФонд > 0 Тогда
		ПереплатаПоПенсионномуФонду = ПенсионныйФонд;
	ИначеЕсли ПенсионныйФонд < 0 Тогда
		ОбязательстваПоПенсионномуФонду = - ПенсионныйФонд;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
